{"timestamp": "2025-06-14T17:37:26.683919", "content": [{"title": "Am I overreacting for wanting to fire my highest paying client after they called me at 2am… again?", "score": 355, "author": "BuildYourBrandDMA", "created_utc": "2025-06-07 20:54:03", "url": "https://www.reddit.com/r/smallbusiness/comments/1l632zk/am_i_overreacting_for_wanting_to_fire_my_highest/", "num_comments": 314, "permalink": "https://reddit.com/r/smallbusiness/comments/1l632zk/am_i_overreacting_for_wanting_to_fire_my_highest/", "selftext": "I run a small design agency and picked up this client about 6 months ago. They’re my highest-paying one by far almost 40% of my income right now.\n\nBut they treat me like an employee. Constantly change deadlines. Call me randomly with no warning. And now they’ve called me three times after midnight.\n\nLast night they called at 2:07am to “run an idea past me.” I didn’t answer. This morning they messaged me saying I was “unavailable and unreliable” and they might need to “reconsider our arrangement.”\n\nI’m over it  but firing them would hurt my income.\nI told a friend and they said I’m being dramatic, that I should just set stronger boundaries.\n\nBut honestly, I’m at the point where no money feels worth this kind of stress.\n\nSo… am I overreacting?", "is_self": true, "link_flair_text": "Question"}, {"title": "Lost my job, my wife, and my pride. Being broke is one hell of a wakeup call", "score": 246, "author": "keenoya", "created_utc": "2025-06-14 12:21:47", "url": "https://www.reddit.com/r/smallbusiness/comments/1lbgrmk/lost_my_job_my_wife_and_my_pride_being_broke_is/", "num_comments": 78, "permalink": "https://reddit.com/r/smallbusiness/comments/1lbgrmk/lost_my_job_my_wife_and_my_pride_being_broke_is/", "selftext": "From loyal husband to unemployed designer in one week. Life moves fast. \nA few months ago, I went through a rough period in life. I lost a lot of my possessions to the divorce. My wife was cheating on me with my best friend, while I was working my ass off to pay the bills and put food on the table. The final nail? I lost my job. All of this spiraled me into depression.\n\nI was eating out of what little I had left, and now I'm all out of money. I finally kicked myself in the guts and decided to offer what I'm actually good at.\nI was designing logos for a living. That was my day job, until I lost everything to depression. Now I've started again. But this time, I'm doing it freelance. I'm offering logo design, as well as content creation for social media.\n\nToday I secured a deal to design a grocery store logo in my neighborhood for 590.\n\nI know $590 isn't much, but I'm already all out of money. So this is my start. This is where I reclaim my life.\n\nSo I have this one question for you guys, A few days ago, I saw a post about a fancy studio converting potential clients into paying ones. I don’t have the money for that. What can I do to improve my odds at securing more leads?\n\nSomeone suggested reading How to Win Friends and Influence People by Dale Carnegie. They say it can help convert leads.\n", "is_self": true, "link_flair_text": "General"}, {"title": "Rule Proposal: No fishing", "score": 199, "author": "nhepner", "created_utc": "2025-06-10 11:23:48", "url": "https://www.reddit.com/r/smallbusiness/comments/1l868nh/rule_proposal_no_fishing/", "num_comments": 65, "permalink": "https://reddit.com/r/smallbusiness/comments/1l868nh/rule_proposal_no_fishing/", "selftext": "I see so many posts in here asking \"what small business problem could software solve for you?\" or similar. \n\nUsually, these posts are people offering \"free\" development services, which pretty squarely falls under self-promotion, but sometimes it's just people fishing for ideas, or trying to find ways to pitch something to members of this community. \n\nI'm fine with some pushback and/or refinement of this idea - I can see an argument for validating business ideas, but the posts I'm talking about are just lazy and noise. ", "is_self": true, "link_flair_text": "General"}, {"title": "Purchasing a Gas Station 2025 bad idea?", "score": 108, "author": "Capable_Wallaby_4760", "created_utc": "2025-06-07 20:43:05", "url": "https://www.reddit.com/r/smallbusiness/comments/1l62wgw/purchasing_a_gas_station_2025_bad_idea/", "num_comments": 111, "permalink": "https://reddit.com/r/smallbusiness/comments/1l62wgw/purchasing_a_gas_station_2025_bad_idea/", "selftext": "I'm thinking of purchasing a branded gas station for $200k it makes $60k net after expenses each year. It's technically 9 years sublease I'm taking over.\n\nIt's located in south NJ, so that cuts deep into the profit as I need two employees. It is located on a busy highway but with heavy competition like Costco gas and wawa.\n\nRight now, it will be nearly 3-4 years to break even. There is no possibility to open a store because of its small size. I don't think the landlord allows anything, so it's just gas. My only option for increasing revenue is to get gas clients like buses or dealerships to use me.\n\nIt's absentee right now. I'm just not sure if it's worth doing? (I ran the pnl to their receipts, but it seems correct, but I will never know 100%) Who could I connect with to double-check my due diligence? I don't want to rush into a bad choice.\n\nWhat's going for me is that its already absentee, if the numbers are right? Its okay, ROI, and let's me get my foot into the gas business. But only way to grow is to secure gas contracts with local businesses.", "is_self": true, "link_flair_text": "Question"}, {"title": "Inheriting a company", "score": 84, "author": "Gizzardsnatcher", "created_utc": "2025-06-10 06:41:37", "url": "https://www.reddit.com/r/smallbusiness/comments/1l7z1ez/inheriting_a_company/", "num_comments": 61, "permalink": "https://reddit.com/r/smallbusiness/comments/1l7z1ez/inheriting_a_company/", "selftext": "I have a somewhat complex situation and I need advice. When I was a child, my dad started a small metal fabrication company with a couple partners. I worked there basically whole adult life. Over time I started noticing that our bookkeeper was a complete idiot, but my dad kept her because she was cheap and \"loyal\". Fast forward  to 2016. My dad is the sole owner, and passes away. I am executor, and also become acting president. The company was already in a downward spiral, so I sold it in 2019. I found out while closing the books that our bookkeeper was sporadic in paying payroll taxes. Our company file in quickbooks was mysteriously corrupted, so I don't know what she was doing. Embezzlement? Fraud? Most likely. Either way, I go to file my income tax this year, and there is a lean of some sort. I login to the IRS website, and low and behold. Apparently they think I owe them almost a million dollars. How is it possible to inherit this? I was a shop worker. I know nothing about the books. He trusted the wrong people, because even the accountant didn't catch this. Any advice? I'm about to eat a slug over this. The company wasn't worth much, and I can't pay that kind of money. ", "is_self": true, "link_flair_text": "General"}, {"title": "Dear small business owners. Don't do this. Please.", "score": 80, "author": "ProgramExpress2918", "created_utc": "2025-06-14 02:29:40", "url": "https://www.reddit.com/r/smallbusiness/comments/1lb4onl/dear_small_business_owners_dont_do_this_please/", "num_comments": 27, "permalink": "https://reddit.com/r/smallbusiness/comments/1lb4onl/dear_small_business_owners_dont_do_this_please/", "selftext": "Hey everyone \nI want to remind small business owners.\n\nWhen you set up an Instagram page or Facebook page for your business.\n\nPlease please make sure your website link and product links are shown on your posts ( I know Instagram doesnt allow clickable links but share the link anyway) and make sure you share the product name clearly on your post so clients can search for it on your website.\n\nI came across a small business that sells very nice hair products and I wanted to check it out right I just couldn't find the right link to the product. I basically gave up.\n\nEven the other customers were like \"Where do I buy it\" what's the product name\"\n\nDon't leave your customers confused searching for things all over.\n\nEdit: This is directed at businesses who have a website not those who don't.", "is_self": true, "link_flair_text": "General"}, {"title": "My old boss wants his clients back... sure, let me gift wrap them.", "score": 75, "author": "Akulatay", "created_utc": "2025-06-12 10:21:25", "url": "https://www.reddit.com/r/smallbusiness/comments/1l9s8mp/my_old_boss_wants_his_clients_back_sure_let_me/", "num_comments": 96, "permalink": "https://reddit.com/r/smallbusiness/comments/1l9s8mp/my_old_boss_wants_his_clients_back_sure_let_me/", "selftext": "Just got a call from my former boss , he wants peace.\nThing is, I never tried to hurt his business.\nHe owns a small marketing agency, and I used to be his main design guy. My specialty is logo design, and I’m pretty good at it. So good, in fact, that when he basically forced me to quit, all his clients followed me to my freelance gig.\nAfter I left, he called and told me I’d regret it. Said he’d sue me for stealing clients. he didn’t and two months later, he calls again, this time saying there are no hard feelings and that I should “return” his clients.\nIt all started when the CEO of the agency declared that I deserved the top position, but since they were related, CEO never gave me a shot. I think that made my boss jealous. He made my life hell, both at work and outside of it. Eventually, I quit and went out on my own.\nTurns out, 95% of his clients followed me. His business took a hit, fast. Now he wants me to hand them back like I borrowed them or something.\nI haven’t responded yet. What should I say? I don’t want to sound too harsh or too soft.\nAnd yeah, my first instinct was to say “fuck off,” but I paused to think it through first.\n\n", "is_self": true, "link_flair_text": "General"}, {"title": "Do you brand yourself as local or international when working remotely?", "score": 72, "author": "Lopsided_Minute3864", "created_utc": "2025-06-13 05:37:45", "url": "https://www.reddit.com/r/smallbusiness/comments/1laeut8/do_you_brand_yourself_as_local_or_international/", "num_comments": 11, "permalink": "https://reddit.com/r/smallbusiness/comments/1laeut8/do_you_brand_yourself_as_local_or_international/", "selftext": "Curious how other remote folks are approaching this, if you’re freelancing, running an agency, or selling digital products, do you position yourself as a local brand in your target market, or lean into being international? And have you noticed a difference in conversions, client trust, or platform approval?\n\nI know it depends on the type of business you’re running, some services definitely benefit from a local touch, while others lean into the global vibe. Still, in general do you promote yourself as local or international? I know it's kind of a broad question, but I'm genuinely interested in learning how others navigate this.\n\nWe run a small creative/performance agency, and this came up in a recent convo I had with a friend who’s building her own design studio. She’s based in South Africa and serves mostly Us clients. She told me she recently used a service called Adro banking to set up a US LLC, get a legit NYC address, and a US number. After that, she started seeing improvements like Stripe approval went smoother, and her onboarding process just felt more confident on the client side. It gave her a bit more of that “insider” credibility.\n\nSo I figured I’d ask the community, do you try to appear local to your market? Or do you just keep it global and let your work speak for itself? Open to insights, always down to hear how others are making it work.", "is_self": true, "link_flair_text": "Question"}, {"title": "How long did your EIN take?", "score": 71, "author": "Straight_Afternoon89", "created_utc": "2025-06-12 09:40:25", "url": "https://www.reddit.com/r/smallbusiness/comments/1l9r6hj/how_long_did_your_ein_take/", "num_comments": 42, "permalink": "https://reddit.com/r/smallbusiness/comments/1l9r6hj/how_long_did_your_ein_take/", "selftext": "Finally got everything together to start a business based in the US, and honestly, I’m super excited. Everything else went pretty smoothly, especially considering I’m doing this from abroad. But one thing that caught me off guard? The EIN wait time.\n\nI assumed it’d be quick, but I’ve been waiting 4 weeks now and still nothing. I kept Googling for answers, but it’s hard to find any clear info. I ended up becoming obsessed with sites like EINwaittime that shows how long people are waiting for their EINs. I was checking it like every two hours lol.\n\nNow I’m just kind of lost, did I mess something up? Is it normal to wait this long? Just curious how long yours took, especially if you applied from outside the US.", "is_self": true, "link_flair_text": "Question"}, {"title": "I got a loan today!", "score": 71, "author": "crudeheadgearseller", "created_utc": "2025-06-13 13:41:09", "url": "https://www.reddit.com/r/smallbusiness/comments/1laqjfg/i_got_a_loan_today/", "num_comments": 45, "permalink": "https://reddit.com/r/smallbusiness/comments/1laqjfg/i_got_a_loan_today/", "selftext": "I feel like I'm on a crazy high, and I'm just throwing this out into the universe cause maybe someone else needs a sign like I did. Reddit sorta pushed me to just do it, so thanks to everyone who helped me conquer my fears and go for it. \n\nI went to my credit union and got a pretty decent amount of money to get started. I'm all set up with my LLC and I've got an accountant. Next step is to start buying equipment and getting the hang of marketing so I don't look like a tool. \n\nI haven't ever felt this much excitement for anything, even if this is the easy part. Really looking forward to what comes next, and I'll try to document my wins and losses here so y'all can grow along with me. ", "is_self": true, "link_flair_text": "Lending"}, {"title": "feel like I’ve cornered myself", "score": 54, "author": "None", "created_utc": "2025-06-09 20:58:17", "url": "https://www.reddit.com/r/smallbusiness/comments/1l7p9ft/feel_like_ive_cornered_myself/", "num_comments": 37, "permalink": "https://reddit.com/r/smallbusiness/comments/1l7p9ft/feel_like_ive_cornered_myself/", "selftext": "I've run 2 small brick and mortar stationery/bookshops for the past 10 years. They're my pride and joy, and a big part of my identity. I've been content with them. I've never made a ton of money but enough to live well albeit somewhat modestly. I don't have insane debt, I have a big community, they're well regarded in the neighborhood. But recently I've really felt like I've hit the max growth. I don't see these stores making any more money and I'm starting to wonder if I should throw in the towel soon. A lot of my friends are advancing in their careers, increasing their retirement funds, moving on up in life, etc.  I used to feel like I was the advanced one as a small business owner. But now I feel incredibly left behind. \n\nHas anyone else been at this crossroad? Im worried the longer I wait to pivot into another career, the harder it will get. On the other side, I could keep doing what I do and accept this is just my life. Not really sure what I'm expecting by posting here, just felt like I needed to express this. I'm in my mid 30s fwiw. ", "is_self": true, "link_flair_text": "General"}, {"title": "Client owes $128K after construction, Mech Lien on school building in NY - looking to collect or foreclosure", "score": 53, "author": "mcjoe1015", "created_utc": "2025-06-09 12:43:09", "url": "https://www.reddit.com/r/smallbusiness/comments/1l7ed31/client_owes_128k_after_construction_mech_lien_on/", "num_comments": 26, "permalink": "https://reddit.com/r/smallbusiness/comments/1l7ed31/client_owes_128k_after_construction_mech_lien_on/", "selftext": "Hi all, I'm hoping to get answers from attorneys or people who went through similar experiences\n\nMy client was a GC, didn't pay anything other than the deposit, even after the construction was 95% done. We only received 48K deposit. We had projects (smaller) with this GC in the past, with no payment issues to this extent. The total amount owed, including change orders, is $128K\n\n  \nThe project is located in Brooklyn NY. Exterior work for a school building that is a Preparatory Charter School, renting a portion of the building owned by a Regional High School - The lien is placed on the high school's building as they are the owner\n\n  \nHired an attorney who filed the lien against the property, received by Kings County Court on Nov 4th 2024\n\nSpent the past 7 months trying to negotiate a settlement. We even agreed to settle for $95K, including completing the remaining 5%, which is powering up and setting up the automation for the electric gate\n\nOur last communication was a conference call with the GC and his attorney - us and our attorney. Even his attorney wanted to close the settlement but the GC was pushing hard to bring in the over 20K worth of change order, that had never been approved (not included in the owed/lian amount), to be included in the settlement $95K, Which we couldn't accept given the fact that we have already given up all our profit and more\n\n  \nNow we only see the options of \n\n1. Going with a collection agency, \n\n2. Foreclosing on the property \n\n3. File a lawsuit against the GC, the prep school, and the high school \n\nOur attorney has given us a deal of $10K retainer plus 20% of the received amount after the court judgment. \n\nAt this point, we are seeking a contingency-based agreement with an attorney  \nAny suggestions or inputs?", "is_self": true, "link_flair_text": "General"}, {"title": "Help explaining \"double dipping\" scenario", "score": 51, "author": "Hangry_Pauper", "created_utc": "2025-06-10 19:15:48", "url": "https://www.reddit.com/r/smallbusiness/comments/1l8h6hd/help_explaining_double_dipping_scenario/", "num_comments": 74, "permalink": "https://reddit.com/r/smallbusiness/comments/1l8h6hd/help_explaining_double_dipping_scenario/", "selftext": "Sorry about this.\n\nI run a farm and we're talking about opening a storefront. My business partner thinks for example that selling a tomato to the store, then to the consumer will make us more money than directly to the consumer like we do now. I disagree and think we're just seeing the same dollar twice, but can't explain it succinctly. Am I wrong? Please ELI5 so I can pass it along.", "is_self": true, "link_flair_text": "Help"}, {"title": "For small business owners who grew from $0 to $100K revenue in under a year, what was your key strategy?", "score": 51, "author": "stealthagents", "created_utc": "2025-06-09 05:52:27", "url": "https://www.reddit.com/r/smallbusiness/comments/1l73zye/for_small_business_owners_who_grew_from_0_to_100k/", "num_comments": 110, "permalink": "https://reddit.com/r/smallbusiness/comments/1l73zye/for_small_business_owners_who_grew_from_0_to_100k/", "selftext": "When I first started my business, I did a bunch of guerrilla marketing tactics like :\n\n  \nForums\n\nBlog influencer promotions\n\nCommunities & groups\n\nBuilding my email list\n\nCraigslist\n\n  \nThis got me to my first $100k many years ago. Today, I'm still doing a majority of it except we switched over to ads / SEO & email lists.\n\nWhat strategies did you guys do to get to your first $100k?", "is_self": true, "link_flair_text": "Question"}, {"title": "1 bad customer is ruining it for the bunch.  Not sure how to handle future situations.", "score": 49, "author": "theresilientcreator", "created_utc": "2025-06-09 15:13:28", "url": "https://www.reddit.com/r/smallbusiness/comments/1l7i6eg/1_bad_customer_is_ruining_it_for_the_bunch_not/", "num_comments": 84, "permalink": "https://reddit.com/r/smallbusiness/comments/1l7i6eg/1_bad_customer_is_ruining_it_for_the_bunch_not/", "selftext": "I teach art classes (7 years) and have a challenging \"customer\".  My signup specifies that no refunds are given.  However, I do offer credit and in certain cases, I do offer refunds. It rarely happens but I feel it is good customer service.  \n\nI have a customer that continues to sign up for my art classes but then cancels the day of, last time it was 30 mins before the class.  She has done this three times now.  The group she signs up with are a great bunch.  However, this woman has never actually come to a class.  She interrupts the class with calls & texts to those that are there, she demands to know \"what I am going to do for her\", each time, I specify I will contact her after class with options.  This woman is harassing to say the least.  \n\nShe will email, call, and text me until I get back to her.  The longest it has taken for me to get back to her is noon the next day after the missed class.  She knows my policy yet will ask what her options are and then blast me when I give her options to her:  my class is over priced, the project isn't worth the value, she heard the class ran over by 10 minutes (not due to me), I didn't have a wine stopper for their unused wine, etc.  This last time she stated that she is also a business owner and if I don't give her a refund she will \"escalate\" this and blast me on every social site that she can find.  Entitled is too light of a word to describe this woman.  \n\nEach time I have given a refund as I am hoping that she will never come back.  At this point, I am losing money.  Each time that a transaction goes through or I refund, the credit card company charges me a surcharge.  The last class was a customized project that she asked if the other women in the class or I could make for her.  There wasn't the time, each one took the entire class to complete their project and I charge extra if I do it as it would be my time outside of the class.  She got back to me with she \"will never do this project!\" and \"how dare\" I expect more money for me to complete her project on my \"already overpriced class!\".  So now I am eating the cost of these materials. This woman is a nightmare.  \n\nThis last time after the refund, she emailed me stating that she looks forward to coming in to complete the project that she had previously emailed that she \"will never do!\".  \n\nAnyone have a situation with a repeatedly bad customer?  What is the best way to handle this type of person?  I have already looked into it and there is no way for me to prevent her from signing up for the class.  I feel like I am being held hostage by this woman's threats.  I thought of reaching out to the organizer but as this is her friend, I think that would be unprofessional.  At this point, I don't mind if the group doesn't come back just so I don't have to deal with her but I don't think it is professional to ask them to not come back just because of her bad behavior.  Advice is greatly appreciated.  ", "is_self": true, "link_flair_text": "Question"}, {"title": "Machine I bought for my esthetics business turned out not to be FDA-approved", "score": 47, "author": "Old_Border_2285", "created_utc": "2025-06-13 08:42:54", "url": "https://www.reddit.com/r/smallbusiness/comments/1laj79z/machine_i_bought_for_my_esthetics_business_turned/", "num_comments": 45, "permalink": "https://reddit.com/r/smallbusiness/comments/1laj79z/machine_i_bought_for_my_esthetics_business_turned/", "selftext": "I' am esthetician with a small skincare practice in the U.S. A few months ago, I leased a high-end professional device (NeurotriS SX-3800) from a company in California called NeurotriS. It was marketed as a skin treatment machine. I rally trusted the product because of the company’s reputation and the cost plus I could not find nothing bad abut them online. Recently, I found out the machine is not FDA-approved, and there is actually a formal FDA warning letter stating the machine is “adulterated and misbranded.” [FDA Warning Letter – NeurotriS SX-3800]() I would never use anything unsafe or not legally cleared on my clients, so I reached out to the seller to ask for a return and to close the lease. Unfortunately, I was met with aggression and profanity instead of support. I’m still paying monthly lease payments for a machine I can’t legally or ethically use. This whole thing is very stressful and honestly, I feel scammed.  \nHas anyone experienced something similar? Are there business or legal steps I can take to get out of this lease and protect myself financially and professionally?", "is_self": true, "link_flair_text": "General"}, {"title": "Is it ever worth it to defend your business on Reddit?", "score": 44, "author": "YinzerGator", "created_utc": "2025-06-12 10:06:49", "url": "https://www.reddit.com/r/smallbusiness/comments/1l9rv6z/is_it_ever_worth_it_to_defend_your_business_on/", "num_comments": 73, "permalink": "https://reddit.com/r/smallbusiness/comments/1l9rv6z/is_it_ever_worth_it_to_defend_your_business_on/", "selftext": "I’m a general contractor and recently came across a few false/slamming posts about my company in my local subreddit. None of the claims are true, but I’m torn on whether it’s worth stepping in to set the record straight.\n\nOn one hand, I want to defend my team and our reputation. On the other, I’ve seen this backfire big time. There’s a local dumpster company that tried to do the same a few years back, and the whole thing became a long-running meme.\n\nHas anyone here had a positive experience engaging directly on Reddit to defend their small business? Or is silence the better route?\n\nAppreciate any advice or war stories.", "is_self": true, "link_flair_text": "Question"}, {"title": "What's side hustle unexpectedly turned into your full time job?", "score": 41, "author": "Timely-Okra2117", "created_utc": "2025-06-10 01:27:04", "url": "https://www.reddit.com/r/smallbusiness/comments/1l7tg1v/whats_side_hustle_unexpectedly_turned_into_your/", "num_comments": 46, "permalink": "https://reddit.com/r/smallbusiness/comments/1l7tg1v/whats_side_hustle_unexpectedly_turned_into_your/", "selftext": "I'm curious to hear from someone who started something just for extra money or weekend fun, and then suddenly realized \"oh damn, this could actually pay the bills\"\n\nLike, what's the hustle and at what moment you knew it was more than side gig?", "is_self": true, "link_flair_text": "Question"}, {"title": "Settings Proposal: Post and Karma Minimums", "score": 43, "author": "Grandpas_Spells", "created_utc": "2025-06-11 05:52:42", "url": "https://www.reddit.com/r/smallbusiness/comments/1l8rw5y/settings_proposal_post_and_karma_minimums/", "num_comments": 55, "permalink": "https://reddit.com/r/smallbusiness/comments/1l8rw5y/settings_proposal_post_and_karma_minimums/", "selftext": "I see a rule proposal post but spammers don't care about the rules.\n\nI'd like to suggest karma or post count minimums to post new threads here. This place has become a deluge of trash posts, spammers, crypto scammers, etc. Other subs do not have to deal with this.\n\nThere's no reason to not do this unless the goal is to make this sub's stats artificially high. Nobody comes to Reddit on a brand new account to ask valid SMB questions.\n\nI've enjoyed participating here but the quality has dropped off so dramatically I'd prefer to move on if nothing will be done to improve the quality:trash ratio.", "is_self": true, "link_flair_text": "General"}, {"title": "Just started offering logo designs on Fiverr – any tips to attract my first client?", "score": 42, "author": "Curious_Professor547", "created_utc": "2025-06-08 09:02:38", "url": "https://www.reddit.com/r/smallbusiness/comments/1l6fo3o/just_started_offering_logo_designs_on_fiverr_any/", "num_comments": 38, "permalink": "https://reddit.com/r/smallbusiness/comments/1l6fo3o/just_started_offering_logo_designs_on_fiverr_any/", "selftext": "I recently listed my first gig on Fiverr as a logo designer. No orders yet, and I’m feeling a bit stuck.\nAny advice or strategies that worked for you to get your first client?\nWould love to hear your experience!", "is_self": true, "link_flair_text": "Question"}, {"title": "Promote your business, week of June 9, 2025", "score": 39, "author": "Charice", "created_utc": "2025-06-08 19:00:27", "url": "https://www.reddit.com/r/smallbusiness/comments/1l6t3un/promote_your_business_week_of_june_9_2025/", "num_comments": 274, "permalink": "https://reddit.com/r/smallbusiness/comments/1l6t3un/promote_your_business_week_of_june_9_2025/", "selftext": "Post business promotion messages here including special offers especially if you cater to small business.  \n\n**Be considerate. Make your message concise.**    \n\n**Note:** To prevent your messages from being flagged by the autofilter, don't use shortened URLs.", "is_self": true, "link_flair_text": "Self-Promotion"}, {"title": "Fear of failure", "score": 26, "author": "anotherpaintedlady", "created_utc": "2025-06-13 06:44:25", "url": "https://www.reddit.com/r/smallbusiness/comments/1lagamj/fear_of_failure/", "num_comments": 51, "permalink": "https://reddit.com/r/smallbusiness/comments/1lagamj/fear_of_failure/", "selftext": "Hi there, so I want to eventually have my own small business but the fear of failing freezes me up from time to time and I end up making no progress on my work/journey. And I absolutely hate when this happens. Any advice on how to push through or maybe alter you're way of thinking so the fear of failure isn't as paralyzing? \n\nThank you in advance !! \n\nEdit: you all have helped more than you can imagine. Seriously thank you for all the words, this helped a ton and I can't be more thankful for everyone who commented 🫶🏽", "is_self": true, "link_flair_text": "General"}, {"title": "Best website builder for a new small business?", "score": 25, "author": "gradstudentmit", "created_utc": "2025-06-09 16:37:31", "url": "https://www.reddit.com/r/smallbusiness/comments/1l7k2rs/best_website_builder_for_a_new_small_business/", "num_comments": 54, "permalink": "https://reddit.com/r/smallbusiness/comments/1l7k2rs/best_website_builder_for_a_new_small_business/", "selftext": "I’m launching a small business and need to build a website myself. I want it to look professional, be easy to manage and ideally help bring in traffic.\n\n\n\nI’ve heard of Squarespace, Durable, Shopify and WordPress but I’m not sure which one is best for my needs.\n\n\n\nIf you’ve used any of these (or others), what did you like or dislike?\n\n\n\nWould love any tips before I commit!", "is_self": true, "link_flair_text": "Question"}, {"title": "Trade school / apprenticeship success stories?", "score": 23, "author": "OldSprinkles3733", "created_utc": "2025-06-10 17:29:34", "url": "https://www.reddit.com/r/smallbusiness/comments/1l8f2a4/trade_school_apprenticeship_success_stories/", "num_comments": 6, "permalink": "https://reddit.com/r/smallbusiness/comments/1l8f2a4/trade_school_apprenticeship_success_stories/", "selftext": "I'm thinking about leveraging union apprenticeships and trade school programs. My state is offering incentives through the High Demand Apprenticeship Program for employers that participate in the Registered Apprenticeship Programs (RAPs). Everything sounds great, but my worries are:\n\n* Time Sink: Training takes efforts, will it slow us down too much?\n* Quality Control: How do I know the programs are good and not just churning out half-baked workers\n* Long Game: Will this pay off years down the road?\n\nAnyone here hired from union apprenticeships or trade schools? If so, any recommendations on which programs are the best?", "is_self": true, "link_flair_text": "Question"}, {"title": "Should I stay til the end?", "score": 20, "author": "Chemical-Support4802", "created_utc": "2025-06-11 12:57:01", "url": "https://www.reddit.com/r/smallbusiness/comments/1l92hh3/should_i_stay_til_the_end/", "num_comments": 32, "permalink": "https://reddit.com/r/smallbusiness/comments/1l92hh3/should_i_stay_til_the_end/", "selftext": "I'm an administrative assistant and have been for many, many years. Currently, the business i work for is slowly falling apart. Im a loyal person to this business and my boss. However, im conflicted about staying. Im getting older and not sure how it'd be \"out there\". Im asking owners...would i be one of the last to go? To help finish up, so to speak. I still hope things will turn around but its not looking good.", "is_self": true, "link_flair_text": "Question"}]}