{"timestamp": "2025-06-14T17:56:35.077713", "content": [{"title": "Am I overreacting for wanting to fire my highest paying client after they called me at 2am… again?", "score": 357, "author": "BuildYourBrandDMA", "created_utc": "2025-06-07 20:54:03", "url": "https://www.reddit.com/r/smallbusiness/comments/1l632zk/am_i_overreacting_for_wanting_to_fire_my_highest/", "num_comments": 314, "permalink": "https://reddit.com/r/smallbusiness/comments/1l632zk/am_i_overreacting_for_wanting_to_fire_my_highest/", "selftext": "I run a small design agency and picked up this client about 6 months ago. They’re my highest-paying one by far almost 40% of my income right now.\n\nBut they treat me like an employee. Constantly change deadlines. Call me randomly with no warning. And now they’ve called me three times after midnight.\n\nLast night they called at 2:07am to “run an idea past me.” I didn’t answer. This morning they messaged me saying I was “unavailable and unreliable” and they might need to “reconsider our arrangement.”\n\nI’m over it  but firing them would hurt my income.\nI told a friend and they said I’m being dramatic, that I should just set stronger boundaries.\n\nBut honestly, I’m at the point where no money feels worth this kind of stress.\n\nSo… am I overreacting?", "is_self": true, "link_flair_text": "Question"}, {"title": "Lost my job, my wife, and my pride. Being broke is one hell of a wakeup call", "score": 250, "author": "keenoya", "created_utc": "2025-06-14 12:21:47", "url": "https://www.reddit.com/r/smallbusiness/comments/1lbgrmk/lost_my_job_my_wife_and_my_pride_being_broke_is/", "num_comments": 78, "permalink": "https://reddit.com/r/smallbusiness/comments/1lbgrmk/lost_my_job_my_wife_and_my_pride_being_broke_is/", "selftext": "From loyal husband to unemployed designer in one week. Life moves fast. \nA few months ago, I went through a rough period in life. I lost a lot of my possessions to the divorce. My wife was cheating on me with my best friend, while I was working my ass off to pay the bills and put food on the table. The final nail? I lost my job. All of this spiraled me into depression.\n\nI was eating out of what little I had left, and now I'm all out of money. I finally kicked myself in the guts and decided to offer what I'm actually good at.\nI was designing logos for a living. That was my day job, until I lost everything to depression. Now I've started again. But this time, I'm doing it freelance. I'm offering logo design, as well as content creation for social media.\n\nToday I secured a deal to design a grocery store logo in my neighborhood for 590.\n\nI know $590 isn't much, but I'm already all out of money. So this is my start. This is where I reclaim my life.\n\nSo I have this one question for you guys, A few days ago, I saw a post about a fancy studio converting potential clients into paying ones. I don’t have the money for that. What can I do to improve my odds at securing more leads?\n\nSomeone suggested reading How to Win Friends and Influence People by Dale Carnegie. They say it can help convert leads.\n", "is_self": true, "link_flair_text": "General"}, {"title": "Rule Proposal: No fishing", "score": 197, "author": "nhepner", "created_utc": "2025-06-10 11:23:48", "url": "https://www.reddit.com/r/smallbusiness/comments/1l868nh/rule_proposal_no_fishing/", "num_comments": 65, "permalink": "https://reddit.com/r/smallbusiness/comments/1l868nh/rule_proposal_no_fishing/", "selftext": "I see so many posts in here asking \"what small business problem could software solve for you?\" or similar. \n\nUsually, these posts are people offering \"free\" development services, which pretty squarely falls under self-promotion, but sometimes it's just people fishing for ideas, or trying to find ways to pitch something to members of this community. \n\nI'm fine with some pushback and/or refinement of this idea - I can see an argument for validating business ideas, but the posts I'm talking about are just lazy and noise. ", "is_self": true, "link_flair_text": "General"}, {"title": "Purchasing a Gas Station 2025 bad idea?", "score": 106, "author": "Capable_Wallaby_4760", "created_utc": "2025-06-07 20:43:05", "url": "https://www.reddit.com/r/smallbusiness/comments/1l62wgw/purchasing_a_gas_station_2025_bad_idea/", "num_comments": 111, "permalink": "https://reddit.com/r/smallbusiness/comments/1l62wgw/purchasing_a_gas_station_2025_bad_idea/", "selftext": "I'm thinking of purchasing a branded gas station for $200k it makes $60k net after expenses each year. It's technically 9 years sublease I'm taking over.\n\nIt's located in south NJ, so that cuts deep into the profit as I need two employees. It is located on a busy highway but with heavy competition like Costco gas and wawa.\n\nRight now, it will be nearly 3-4 years to break even. There is no possibility to open a store because of its small size. I don't think the landlord allows anything, so it's just gas. My only option for increasing revenue is to get gas clients like buses or dealerships to use me.\n\nIt's absentee right now. I'm just not sure if it's worth doing? (I ran the pnl to their receipts, but it seems correct, but I will never know 100%) Who could I connect with to double-check my due diligence? I don't want to rush into a bad choice.\n\nWhat's going for me is that its already absentee, if the numbers are right? Its okay, ROI, and let's me get my foot into the gas business. But only way to grow is to secure gas contracts with local businesses.", "is_self": true, "link_flair_text": "Question"}, {"title": "Inheriting a company", "score": 87, "author": "Gizzardsnatcher", "created_utc": "2025-06-10 06:41:37", "url": "https://www.reddit.com/r/smallbusiness/comments/1l7z1ez/inheriting_a_company/", "num_comments": 61, "permalink": "https://reddit.com/r/smallbusiness/comments/1l7z1ez/inheriting_a_company/", "selftext": "I have a somewhat complex situation and I need advice. When I was a child, my dad started a small metal fabrication company with a couple partners. I worked there basically whole adult life. Over time I started noticing that our bookkeeper was a complete idiot, but my dad kept her because she was cheap and \"loyal\". Fast forward  to 2016. My dad is the sole owner, and passes away. I am executor, and also become acting president. The company was already in a downward spiral, so I sold it in 2019. I found out while closing the books that our bookkeeper was sporadic in paying payroll taxes. Our company file in quickbooks was mysteriously corrupted, so I don't know what she was doing. Embezzlement? Fraud? Most likely. Either way, I go to file my income tax this year, and there is a lean of some sort. I login to the IRS website, and low and behold. Apparently they think I owe them almost a million dollars. How is it possible to inherit this? I was a shop worker. I know nothing about the books. He trusted the wrong people, because even the accountant didn't catch this. Any advice? I'm about to eat a slug over this. The company wasn't worth much, and I can't pay that kind of money. ", "is_self": true, "link_flair_text": "General"}]}